## Production: glue 🧴
**✅ &nbsp; Terraform Init:** `success`
**✅ &nbsp; Terraform Validate:** `success`
**✅ &nbsp; Terraform Format:** `success`
**✅ &nbsp; Terraform Plan:** `success`
**✅ &nbsp; Conftest:** `success` 

```terraform
Plan: 2 to add, 8 to change, 0 to destroy
```

<details>
<summary>Show summary</summary>

| CHANGE |                      NAME                       |
|--------|-------------------------------------------------|
| add    | `aws_s3_object.platform_freshdesk_gx`           |
|        | `aws_s3_object.platform_gc_notify_gx`           |
| update | `aws_glue_job.platform_gc_forms_job`            |
|        | `aws_glue_job.platform_gc_notify_job`           |
|        | `aws_glue_job.platform_support_freshdesk`       |
|        | `aws_s3_object.platform_gc_forms_gx`            |
|        | `aws_s3_object.platform_gc_forms_job`           |
|        | `aws_s3_object.platform_gc_notify_job`          |
|        | `aws_s3_object.platform_gc_notify_requirements` |
|        | `aws_s3_object.platform_support_freshdesk_job`  |


</details>


<details>
<summary>Show plan</summary>

```terraform
Resource actions are indicated with the following symbols:
  + create
  ~ update in-place

Terraform will perform the following actions:

  # aws_glue_job.platform_gc_forms_job will be updated in-place
  ~ resource "aws_glue_job" "platform_gc_forms_job" {
      ~ default_arguments         = {
          + "--first_date"                       = "yesterday"
          + "--last_date"                        = "yesterday"
            # (18 unchanged elements hidden)
        }
        id                        = "Platform / GC Forms"
        name                      = "Platform / GC Forms"
        tags                      = {}
        # (16 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # aws_glue_job.platform_gc_notify_job will be updated in-place
  ~ resource "aws_glue_job" "platform_gc_notify_job" {
      ~ default_arguments         = {
          + "--enable-continuous-cloudwatch-log" = "true"
          + "--gx_config_object"                 = "s3://cds-data-lake-glue-production/platform/gc_notify/gx.zip"
            # (18 unchanged elements hidden)
        }
      - execution_class           = "STANDARD" -> null
        id                        = "Platform / GC Notify"
        name                      = "Platform / GC Notify"
        tags                      = {}
        # (15 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # aws_glue_job.platform_support_freshdesk will be updated in-place
  ~ resource "aws_glue_job" "platform_support_freshdesk" {
      ~ default_arguments         = {
          + "--additional-python-modules"        = "great_expectations==0.18.22"
          + "--gx_config_object"                 = "s3://cds-data-lake-glue-production/platform/support/freshdesk/gx.zip"
            # (16 unchanged elements hidden)
        }
        id                        = "Platform / Support / Freshdesk"
        name                      = "Platform / Support / Freshdesk"
        tags                      = {}
        # (16 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # aws_s3_object.platform_freshdesk_gx will be created
  + resource "aws_s3_object" "platform_freshdesk_gx" {
      + acl                    = (known after apply)
      + arn                    = (known after apply)
      + bucket                 = "cds-data-lake-glue-production"
      + bucket_key_enabled     = (known after apply)
      + checksum_crc32         = (known after apply)
      + checksum_crc32c        = (known after apply)
      + checksum_crc64nvme     = (known after apply)
      + checksum_sha1          = (known after apply)
      + checksum_sha256        = (known after apply)
      + content_type           = (known after apply)
      + etag                   = "27e48cab8bebc89835202e6525a65f5f"
      + force_destroy          = false
      + id                     = (known after apply)
      + key                    = "platform/support/freshdesk/gx.zip"
      + kms_key_id             = (known after apply)
      + server_side_encryption = (known after apply)
      + source                 = "./etl/platform/support/freshdesk/gx.zip"
      + storage_class          = (known after apply)
      + tags_all               = {
          + "CostCentre" = "PlatformDataLake"
          + "Terraform"  = "true"
        }
      + version_id             = (known after apply)
    }

  # aws_s3_object.platform_gc_forms_gx will be updated in-place
  ~ resource "aws_s3_object" "platform_gc_forms_gx" {
      ~ etag                          = "9c58a4a17bf11364bde2bc2e2dfa84a0" -> "d9753db6bf59c679b55531a6b1d281ee"
        id                            = "platform/gc_forms/gx.zip"
        tags                          = {}
      ~ version_id                    = "LiJmtrN_WOwtUnGc3yavnVS3fYhgGGoO" -> (known after apply)
        # (24 unchanged attributes hidden)
    }

  # aws_s3_object.platform_gc_forms_job will be updated in-place
  ~ resource "aws_s3_object" "platform_gc_forms_job" {
      ~ etag                          = "667e9b10a73493d65744dbe412a51b98" -> "965ec97bf142119262ecfb5048ac951e"
        id                            = "platform/gc_forms/process_data.py"
        tags                          = {}
      ~ version_id                    = "oDwbZTN.doZn6Ra.r4nJCdYsb4GXpTZU" -> (known after apply)
        # (24 unchanged attributes hidden)
    }

  # aws_s3_object.platform_gc_notify_gx will be created
  + resource "aws_s3_object" "platform_gc_notify_gx" {
      + acl                    = (known after apply)
      + arn                    = (known after apply)
      + bucket                 = "cds-data-lake-glue-production"
      + bucket_key_enabled     = (known after apply)
      + checksum_crc32         = (known after apply)
      + checksum_crc32c        = (known after apply)
      + checksum_crc64nvme     = (known after apply)
      + checksum_sha1          = (known after apply)
      + checksum_sha256        = (known after apply)
      + content_type           = (known after apply)
      + etag                   = "d25f738fc466015df3b4efb6afd4ba53"
      + force_destroy          = false
      + id                     = (known after apply)
      + key                    = "platform/gc_notify/gx.zip"
      + kms_key_id             = (known after apply)
      + server_side_encryption = (known after apply)
      + source                 = "./etl/platform/gc_notify/gx.zip"
      + storage_class          = (known after apply)
      + tags_all               = {
          + "CostCentre" = "PlatformDataLake"
          + "Terraform"  = "true"
        }
      + version_id             = (known after apply)
    }

  # aws_s3_object.platform_gc_notify_job will be updated in-place
  ~ resource "aws_s3_object" "platform_gc_notify_job" {
      ~ etag                          = "cda87db0f81ea8e7f34ace5b7b75e30a" -> "0c75dfc4534411d9c18d694d2492fbc9"
        id                            = "platform/gc_notify/process_data.py"
        tags                          = {}
      ~ tags_all                      = {
          + "CostCentre" = "PlatformDataLake"
          + "Terraform"  = "true"
        }
      ~ version_id                    = "RtgpkjHpR1zmCGB9X7nKrSOBoZQSeD2Z" -> (known after apply)
        # (23 unchanged attributes hidden)
    }

  # aws_s3_object.platform_gc_notify_requirements will be updated in-place
  ~ resource "aws_s3_object" "platform_gc_notify_requirements" {
      ~ etag                          = "94d18cc6f3c8e50a1e3a988e78e6a849" -> "a6cf35ad25841f1de7909912c6b12b1c"
        id                            = "platform/gc_notify/requirements.txt"
        tags                          = {}
      ~ version_id                    = "1IrHxHgo_aQDjGOgu.N2fDQ2vccirFNy" -> (known after apply)
        # (24 unchanged attributes hidden)
    }

  # aws_s3_object.platform_support_freshdesk_job will be updated in-place
  ~ resource "aws_s3_object" "platform_support_freshdesk_job" {
      ~ etag                          = "4a7318262c50a84051bd61f4f251767b" -> "68299a22412b1d85c1d032e346493fd7"
        id                            = "platform/support/freshdesk/process_tickets.py"
        tags                          = {}
      ~ version_id                    = "vNCY9daQprhgF_D5PRt5Tr9AQpbd5pBI" -> (known after apply)
        # (24 unchanged attributes hidden)
    }

Plan: 2 to add, 8 to change, 0 to destroy.

─────────────────────────────────────────────────────────────────────────────

Saved the plan to: plan.tfplan

To perform exactly these actions, run the following command to apply:
    terraform apply "plan.tfplan"

```

</details>

<details>
<summary>Show Conftest results</summary>

```sh
WARN - plan.json - main - Missing Common Tags: ["aws_glue_catalog_database.bes_crm_salesforce_production"]
WARN - plan.json - main - Missing Common Tags: ["aws_glue_catalog_database.operations_aws_production"]
WARN - plan.json - main - Missing Common Tags: ["aws_glue_catalog_database.operations_aws_production_raw"]
WARN - plan.json - main - Missing Common Tags: ["aws_glue_catalog_database.platform_gc_forms_production"]
WARN - plan.json - main - Missing Common Tags: ["aws_glue_catalog_database.platform_gc_forms_production_raw"]
WARN - plan.json - main - Missing Common Tags: ["aws_glue_catalog_database.platform_gc_notify_production"]
WARN - plan.json - main - Missing Common Tags: ["aws_glue_catalog_database.platform_support_production"]
WARN - plan.json - main - Missing Common Tags: ["aws_glue_catalog_database.platform_support_production_raw"]
WARN - plan.json - main - Missing Common Tags: ["aws_glue_crawler.operations_aws_production_account_tags"]
WARN - plan.json - main - Missing Common Tags: ["aws_glue_crawler.operations_aws_production_cost_usage_report"]
WARN - plan.json - main - Missing Common Tags: ["aws_glue_crawler.platform_gc_forms_templates_production_raw"]
WARN - plan.json - main - Missing Common Tags: ["aws_glue_crawler.platform_support_freshdesk_production"]
WARN - plan.json - main - Missing Common Tags: ["aws_glue_job.bes_crm_salesforce"]
WARN - plan.json - main - Missing Common Tags: ["aws_glue_job.platform_gc_forms_job"]
WARN - plan.json - main - Missing Common Tags: ["aws_glue_job.platform_gc_notify_job"]
WARN - plan.json - main - Missing Common Tags: ["aws_glue_job.platform_support_freshdesk"]
WARN - plan.json - main - Missing Common Tags: ["aws_glue_trigger.bes_crm_salesforce"]
WARN - plan.json - main - Missing Common Tags: ["aws_glue_trigger.platform_gc_forms_job"]
WARN - plan.json - main - Missing Common Tags: ["aws_glue_trigger.platform_gc_notify_job"]
WARN - plan.json - main - Missing Common Tags:...
```

</details>
